# 내용 협상과 트랜스 코딩

## 1. 내용 협상

클라이언트가 같은 컨텐츠에 대해 다양한 버전의 컨텐츠를 제공받아야 하는 경우, 클라이언트와 서버가 어떻게든 커뮤니케이션을 진행하게 되는데 이를 **내용 협상**이라고 한다. 간단히 언어를 예로 들 수 있다.  

`www.dropy.online`을 사용자들이 이용하려고 할 때, 같은 컨텐츠에 대해 영미권 사람들은 영어로, 한국 사람들은 한국어로 컨텐츠를 제공 받고 싶어 할 것이다. 이를 구현하는 방식에는 다양한 방식들이 있을 것이고 여기에 대해 이제 논하려 한다.

---

### 1.1. 클라이언트 주도 협상

클라이언트가 직접 선택지를 고르는 방식으로  
다음의 세 **프로세스**에 따라 진행되는 협상을 의미한다.

1. 클라이언트가 특정 리소스(`www.dropy.online`)를 요청한다.
2. 서버는 그에 대한 선택지를 응답으로 준다.
    - `["www.dropy.online/en", "www.dropy.online/ko"]`
3. 클라이언트가 응답지에서 적절한 옵션을 선택하여 재요청 한다.

이것에 대한 **단점**은 분명하다.

1. 요청이 두번 발생한다.
2. 같은 컨텐츠가 여러개의 URL을 갖게 된다.

---

### 1.2. 서버 주도 협상

클라이언트의 요청 헤더값에 따라 서버가 알아서 컨텐츠를 변경해주는 방식으로  
보통 아래의 헤더들이 많이 사용된다.

- `Accept`: 미디어 타입 (ex. text/plain)
- `Accept-Language`: 언어 (ex. en-US)
- `Accept-Charset`: 차셋 (ex. UTF-8)
- `Accept-Encoding`: 인코딩 (ex. gzip)
- `User-Agent`: 사용자 기기

서버는 위의 헤더값들에 따라서, 컨텐츠를 다르게 보내줄 수 있다.

#### 헤더의 품질 값

클라이언트 측에서는 위의 헤더값을 보낼 때, 품질(선호도)을 포함해서 보낼 수 있다.  
품질은 `q`값(0~1)을 이용해서 보내며, 아래의 예제를 보면 바로 이해할 수 있을 것이다.

`Accept-Language: ko;q=1.0 en;q=0.5 fr;q=0.0`

위의 값을 보면 한국어는 1의 선호도, 영어는 0.5의 선호도, 프랑스어는 0.0의 선호도를 갖는다.  
따라서, 서버 측에서 한국어로 보낼수 있다면 한국어, 한국어가 없다면 영어, 영어도 없다면 프랑스어로 컨텐츠를 보낼 것이다.

#### 아파치

아파치에서는 이 내용협상을 자동화할 수 있는 포맷을 지원한다.  
type-map 파일을 아래와 같이 작성하여, 매칭되는 헤더값에 URI를 자동으로 연결시킬 수 있다.

```none
URI: joes-hardware.html

URI: joes-hardware.en.html
Content-type: text/html
Content-language: en

URI: joes-hardware.fr.de.html
Content-type: text/html;charset=iso-8859-2
Content-language: fr, de
```

---

### 1.3. 투명 협상

투명 협상은 클라이언트와 서버 사이에 중개자를 두는 협상방식을 의미한다.  
하지만 협상방식에 대해서 HTTP는 정의하고 있지 않다.  
다만, `Vary` 헤더에 대한 명세가 있기에 이를 이용해서 투명협상을 진행할 수 있다.

#### Vary 헤더

중개자에게 어떤 헤더값을 통해 의사결정해야 하는지 알려주는 헤더값이다.  
예를 들어서 `Vary: Accept-Language` 라고 명시되었다면, URL이 같은 아래의 두 요청을 다른 요청으로 인식하여 서버에게 다시 컨텐츠를 받아 올 것이다.
 

```
# Request 1
GET http://www.joes-hardware.com/ HTTP/1.0
Vary: Accept-Language
Accept-Language: en

# Request2
GET http://www.joes-hardware.com/ HTTP/1.0
Vary: Accept-Language
Accept-Language: ko
```

그리고 이렇게 서버로부터 가져온 다른 버전의 컨텐츠를 **variant** 또는 **alternate** 라고 부른다.

---

## 2. 트랜스 코딩

클라이언트와의 협상내용에 맞는 컨텐츠가 없거나, 자체적으로 변환이 필요하다고 생각되는 경우도 있을 것이다.
이 때 컨텐츠를 변환해서 전달해줄 수도 있을텐데 이를 **트랜스코딩**이라고 부른다.

### 2.1. 포맷 변환

클라이언트에 따라 포맷을 변환해줘야하는 경우도 있다.  
예를 들면, 클라이언트의 버전이 너무 오래되어 자바스크립트 버전 호환이 안되면 구버전의 자바스크립트를 제공해야할 것이고,  
HTML을 지원하지 않는 기기에서 요청을 보냈을 떄 WML 등의 포맷으로 보내는 방식도 있을 것이다.

### 2.2. 정보 합성

컨텐츠를 요점만 추출하는 것을 의미한다. (ex. 광고제거 - 유튜브 프리미엄)

### 2.3. 콘텐츠 주입

새로운 컨텐츠를 주입하는 것을 의미한다. (ex. 광고 - 일반 사용자)
